// проверить RegExp телефонный номер на наличие или отсутствие символов
var regexp = /^\+?\d{2}\(?\d{3}\)?\d{3}[-:]?\d{2}[-:]?\d{2}$/;
console.log(regexp.test("+33(055)333-33-33"));


// проверить  email
var regexp = /^[0-9a-z-_\.]+\@[a-z]{3,5}\.[a-z]{2,4}$/i;
//какой из вариатов предпочтительнее и почему?
var regexp = /^[\w-\.]*\@[\w-]+\.[a-z]{2,4}$/i;
console.log(regexp.test("nick.lotoskiy@gmail.com"));


// проверяет дату 19.11. с 1936 по 2018. Затем интервал - с начала года 1937 по конец 2018., где в кажном месяце 31 день (в феврале - только 29 дней (30.02 - false, однако 31.02 - true???))
var regexp = /^(19.11.(193[6-9]|19[4-9][0-9]|200[0-9]|201[0-8]))|((0?[1-9]|[12][0-9]|3[01]).(0?[1]|0?[3-9]|1[012]).(193[7-9]|19[4-9][0-9]|200[0-9]|201[0-8]))|((0?[1-9]|[12][0-9]).(0?2).(193[6-9]|19[4-9][0-9]|200[0-9]|201[0-8]))$/;
console.log(regexp.test("19.11.2019"));


// функция выводит в консоль все високосные года, начиная с 1900. Года проверяем с помощью регулярки
function isLeapYear() {
    var enterYear = prompt('Является ли год високосным?', 'Проверка начинается с 1900 по 2018');
    var regexp = /^19[0-9][0-9]|200[0-9]|201[0-8]$/;
    if (enterYear < 1900) {
        console.log('Год ' + enterYear + " - меньше чем 1900"); return true}
    if (((enterYear % 4 == 0 && enterYear != 0) || (enterYear % 400 == 0)) && regexp.test(enterYear)){
        console.log('Год ' + enterYear + ' - високосный!');
    } else {
        console.log('Год ' + enterYear + ' - НЕ високосный!');
    }
}
isLeapYear();